//
//  DobavkiView.swift
//  Gym rats
//
//  Created by Artem Leschenko on 19.02.2023.
//

import SwiftUI
struct Dobavki: View {
    let title, image, text:String
    var body: some View {
        
            VStack{
                Image(image).resizable()
                    .frame(minWidth: 250, maxWidth: 250, minHeight: 250, maxHeight: 250)
                    .padding(.top, 20)
                Text(title).font(.custom("", size: 23))
                    .padding(2)
                    .frame(maxWidth: .infinity)
                    .foregroundColor(.white)
                    .background(.secondary)
                    .padding(.horizontal, 10)
                
                ScrollView{
                    Text(text).padding()
                }
                
                    
                    Spacer()
            }
            .frame(maxWidth: 350, maxHeight: .infinity)
                .background()
                .cornerRadius(12)
                .shadow(radius: 12)
                
    }
}

var mass_dobavki = [Dobavki (title: "Креатин", image: "0", text: "100% Моногідрат креатину особливо популярний серед спортсменів, що займаються силовими тренуваннями, шанувальників HIIT і гравців командних видів спорту. Однак його можуть використовувати всі активні люди, для яких важливі швидкість, витривалість і максимальна сила. Креатин може підвищити продуктивність під час коротких послідовних інтервалів інтенсивних тренувань. Щоб оцінити його ефекти, ви повинні приймати не менше 3 г креатину в день. Ви можете покрити цю кількість за допомогою однієї порції цієї суміші.100%\n\nКреатин також природним чином міститься в нашому організмі. Так що це не небезпечний інгредієнт, а наша власна речовина. Людське тіло навіть в деякій мірі здатне його виробляти самостійно. Проте, ми можемо збільшити його вміст в організмі за рахунок раціону і прийому добавок. Приклад: щоб отримати 5 г креатину з яловичини, яка є одним з його найбагатших джерел, необхідно з'їсти 1 кг м'яса. Це також причина того, чому люди вважають за краще використовувати добавки, коли вони легко заповнюють необхідну кількість однією порцією розчинної суміші."),
                Dobavki (title: "Протеїн", image: "1", text: "Протеїни це концентровані джерела білка, які легко допоможуть вам доповнити ваш раціон цим найважливішим макроелементом. Кожна людина, залежно від свого рівня активності, повинна приймати 1,2 - 2 г білка на кілограм маси тіла. Протеїн є чудовим варіантом, як полегшити прийом білка. Така добавка підійде вам у тому разі, якщо ви не можете досягати достатнього прийому білка зі свого раціону. Він ідеально підходить для вживання після тренувань у вигляді напою або швидкого перекусу, який допоможе вам швидше відновлювати м'язи та підтримувати їхній ріст і захист. Ви також можете додавати протеїн до своїх страв і створювати комплексні прийоми їжі, які допоможуть вам доповнити білок і вгамувати апетит."),
                Dobavki (title: "Гейнер", image: "2", text: "Гейнер – це спеціальна харчова добавка для спортсменів, що складається з натурального білка і вуглеводів. Процентне співвідношення цих речовин може варіюватися від 50/40 до 75/15, в залежності від виробника і виду. Крім вуглеводно–білкової основи, цей вид харчування включає також суміш декількох протеїнів і вуглеводів з різним глікемічним індексом – для постійного відновлення глікогену в м'язах і швидкого відновлення після активних занять спортом. В добавок до основних компонентів, якісний гейнер відрізняє широкий спектр вітамінів, мінералів, ненасичених жирів і травних ензимів. Ці речовини забезпечують легке і швидке засвоєння білка, сприяють утворенню оптимального енергетичного потенціалу і швидкому росту м'язової маси.")]

var lw_dobavki = [Dobavki (title: "L-Карнітін", image: "3", text: "L-карнітин є найбільш поширеною формою карнітину, який грає важливу роль в метаболізмі людини. Він присутній в кожній клітині людського організму, і його роль полягає в забезпеченні передачі жирних кислот в мітохондрії. Основна функція мітохондрій полягає у виробленні енергії для функціонування клітин. L-карнітин є одним з найпопулярніших жироспалювачів, і завдяки своїй рідкій формі він швидко засвоюється організмом. Одна доза препарату має 2200 мг L-карнітину без консервантів."), Dobavki (title: "Синефрин", image: "4", text: "Синефрин є одним з найпопулярніших жироспалювачів, який здатний підтримувати термогенез. Він активує β-3 адренорецептори, які крім посилення термогенеза також сприяють розщепленню жирів. Синефрин є натуральним жиросжигателем за доступною ціною."), Dobavki (title: "Хітозан", image: "5", text: "Хітозан - неперетравлювана речовина вуглеводного походження, яку отримують переважно з панцирів морських ракоподібних. Організм не розщеплює її на енергію, але здатен збільшувати її об'єм у травному тракті, що може сприяти виникненню відчуття ситості. Крім того, він підтримує підтримання оптимального рівня холестерину в крові. Це робить його придатним для схуднення та підтримання здоров'я вашого серця і кровоносних судин. Профіль інгредієнтів також включає вітамін С, який підтримує правильну функцію імунної та нервової систем, а також психічну рівновагу. ")]

var health_dobavki = [Dobavki (title: "Omega 3", image: "6", text: "Омега-3 - це омега-3 жирні кислоти, незамінні ненасичені жирні кислоти, які організм не вміє синтезувати сам. Саме з цієї причини їх необхідно отримувати у вигляді їжі або харчових добавок. Харчова добавка Omega 3 містить 18% EPA (ЕПК) і 12% DHA (ДГК), які підтримують серцево-судинну систему. Однак цей ефект досягається тільки після прийому дози 250 мг в день. Крім того, докозагексаеновая кислота або ДГК (DHA) сприяє підтриманню хорошого зору і правильної роботи мозку. Омега-3 капсули також збагачені вітаміном Е."), Dobavki (title: "Bітамін D3", image: "7", text: "Вітамін D3 це природна форма вітаміну D, який відноситься до одних з поживних речовин, необхідних для життя. Його природним джерелом є сонячне світло, який для більшості недоступний в достатніх кількостях. Головним завданням вітаміну D є утримання нормального рівня кальцію і фосфору в крові, а також має вплив на імунну систему, регулює рівень кров'яного тиску і зростання кров'яних, м'язових і шкірних клітин."), Dobavki (title: "Еритрит", image: "8", text: "Еритритол - це замінник цукру, особливо популярний серед прихильників здорового способу життя. Він не містить калорій і підходить для здорового підсолоджування, наприклад, під час схуднення, коли ви стежите за кожним грамом цукру у своєму раціоні. Крім того, еритрит має найнижчий глікемічний індекс, що дорівнює 0. Це означає, що він не підвищує рівень глюкози в крові і може використовуватися для підсолоджування як їжі, так і напоїв. ")]

struct Dobavki_Previews: PreviewProvider {
    static var previews: some View {
        Dobavki (title: "Креатин", image: "1", text: "fdsc")
    }
}
